* Pretty printing latex output from sympy
  :PROPERTIES:
  :categories: python,sympy
  :END:


Let us solve a steady state continuously stirred tank reactor mole balance for the volume.

#+BEGIN_SRC python 
from sympy import *

Fa, Fa0, V, ra = symbols('Fa Fa0 V ra')

expr = solve(Fa0 - Fa + ra * V, V)
print latex(expr, mode='inline')
#+END_SRC

#+RESULTS:
: $\begin{bmatrix}\left(Fa - Fa_{0}\right) / ra\end{bmatrix}$

We can solve differential equations.

#+BEGIN_SRC python
from sympy import *
from sympy.abc import t
Ca = Function("Ca")

Ca_ = Derivative(Ca(t), t)
soln = dsolve(Ca_ - Ca(t))
print latex(soln, mode='inline')
#+END_SRC

#+RESULTS:
: $\operatorname{Ca}{\left (t \right )} = C_{1} e^{t}$


